package com.telran.prof.hometask.linkedList06032024.CustLinkedListListIterator;

//С консоли два игрока , по очереди вводят название городов.
//         Каждое введенное название города нужно запомнить в структуре данных.
//         Но запоминать нужно не как строку, а как объект класса City, который
//         содержит поле с названием города.
//         Если игрок вводит название города , которое уже раньше
//         использовалось , то увеличивать счетчик повторений на 1.
//         Когда счетчик повторений достигнет 5 - игра останавливается и
//         выводится список всех названных городов и список всех
//         городов что были названые два и более раз.
//         Города хранить в HashSet.

public class CustLinkdlstListITR {
    
}
